Revit 2026 API

# ConnectorIsMovable Property

---

whether the connector can be moved.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsMovable { get; }
```
```vb
Public ReadOnly Property IsMovable As Boolean
	Get
```
```cpp
public:
property bool IsMovable {
	bool get ();
}
```
```fsharp
member IsMovable : bool with get
```

#### Property Value

Boolean

Only connectors of type EndConn can be moved.

#### Reference

Connector Class

Autodesk.Revit.DB Namespace